/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "輸入憑證";
"CONNECT_TO_SERVER" = "連接伺服器";
"PRINTER_AUTH" = "印表機認證";
"SCREEN_SHARE_AUTH" = "共享螢幕";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "請輸入您的名稱和密碼來連接“%@”。";
"GENERIC_MSG_PASS" = "請輸入您的密碼來連接“%@”。";
"GENERIC_MSG_NONAME" = "請輸入您的使用名稱和密碼。";

/* Protocol Specific */
"AFP_MSG" = "請為伺服器“%@”輸入您的名稱和密碼。";
"SMB_MSG" = "請為伺服器“%@”輸入您的名稱和密碼。";
"FTP_MSG" = "請為伺服器“%@”輸入您的名稱和密碼。";
"WEBDAV_MSG" = "請為伺服器“%@”輸入您的名稱和密碼。";

/* File Server */
"FS_MSG_BOTH" = "請為伺服器“%@”輸入您的名稱和密碼。";
"FS_MSG_PASS" = "請輸入伺服器“%@”的密碼。";

/* Generic Server */
"SRV_MSG_BOTH" = "請為伺服器“%@”輸入您的名稱和密碼。";
"SRV_MSG_PASS" = "請輸入伺服器“%@”的密碼。";

/* Printer */
"PRINT_MSG_BOTH" = "請為印表機“%@”輸入您的名稱和密碼。";
"PRINT_MSG_PASS" = "請輸入印表機“%@”的密碼。";

/* Print Server */
"PS_MSG_BOTH" = "請輸入您的使用者名稱和密碼來連接列印伺服器“%@”。";
"PS_MSG_PASS" = "請輸入您的使用者名稱和密碼來連接列印伺服器“%@”。";

/* Screen Sharing */
"SS_MSG_BOTH" = "請輸入您的名稱和密碼來共享“%@”的螢幕。";
"SS_MSG_PASS" = "請輸入您的密碼來共享“%@”的螢幕。";

"VS_MSG_BOTH" = "請輸入您的名稱和密碼來檢視“%@”的螢幕。";
"VS_MSG_PASS" = "請輸入您的密碼來檢視“%@”的螢幕。";

/* Time Machine */
"TM_MSG_BOTH" = "請輸入伺服器“%@”的名稱和密碼，讓 Time Machine 可以連接伺服器。";
"TM_MSG_PASS" = "請輸入伺服器“%@”的密碼，讓 Time Machine 可以連接伺服器。";

/* Pre Auth */
"PA_MSG_BOTH" = "請為代理伺服器“%@”輸入您的名稱和密碼。";
"PA_MSG_PASS" = "請輸入代理伺服器“%@”的密碼。";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "連接";
"SHARE" = "共享";
"PRINT" = "列印";
"VIEW" = "顯示方式";
"OK" = "好";

"CONNECT_AS" = "連接身份：";
"GUEST" = "訪客";
"REGISTERED_USER" = "註冊使用者";

"CONNECT_BY" = "連接：";
"BY_ASKING_FOR_PERMISSION" = "以要求權限的方式";
"AS_REGISTERED_USER" = "以註冊使用者的身分";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "網域\\使用者名稱";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "在“%@”上選擇您要裝載的卷宗：";
"SELECT_VOLUME" = "選擇要裝載的卷宗：";

"SELECT_PRINTER_ON_SERVER" = "選擇“%@”上的印表機：";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "西方語系（Mac）";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "更改“%2$@”上“%1$@”的密碼。";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "正在連接⋯";
"CONNECTING_TO_HOST" = "正在連接“%@”。";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "輸入“%@”的密碼，位於檔案伺服器“%@”上。";
"ENTER_VOLUME_PASSWORD" = "輸入“%@”的密碼。";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "網路密碼";
"PRINT_PASSWORD" = "印表機密碼";
"AFP_PASSWORD" = "AFP 密碼";
"SMB_PASSWORD" = "SMB 密碼";
"FTP_PASSWORD" = "FTP 密碼";
"WEBDAV_PASSWORD" = "WebDAV 密碼";
"VNC_PASSWORD" = "VNC 密碼";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "發生錯誤。";
"EMSG_INVALID_PWD" = "您輸入了無效的密碼。";
"EMSG_INVALID_NAME_PWD" = "您輸入的使用者名稱或密碼無效。";
"EMSG_PWD_EXPIRED" = "您的密碼已經到期。";
"EMSG_PWD_NEEDS_CHANGE" = "您的密碼必須更改。";
"EMSG_PWD_POLICY" = "您的密碼不符合伺服器執行的規則。";
"EMSG_CONNECTION_FAILED" = "連線失敗";

"EMSG_MOUNT_FAILURE" = "裝載卷宗失敗。";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "請再試一次。";
"EINFO_CONTACT_ADMIN" = "如需更多資訊，請聯絡系統管理者。";

"EINFO_NO_ACCESS_USER" = "您沒有連接伺服器“%@”的權限。";
"EINFO_NO_ACCESS_GUEST" = "伺服器“%@”不允許“訪客”連線。";
"EINFO_SAME_MACHINE" = "伺服器“%@”目前可以在您的電腦上使用。請取用本機上的卷宗和檔案。";
"EINFO_NO_SERVER" = "伺服器“%@”可能不存在或目前無法使用。請檢查伺服器名稱或 IP 位址和您的網路連線，然後再試一次。";
"EINFO_TOO_MANY_USERS" = "伺服器“%@”不允許其他使用者登入。請稍後再嘗試連接。";
"EINFO_GENERAL" = "連接伺服器“%@”時發生錯誤。請檢查伺服器名稱或 IP 位址，然後再試一次。\n\n若您無法解決問題，請聯絡您的系統管理者。";
"EINFO_NO_SHARES" = "沒有共享的項目，或是您未被允許在伺服器“%@”上連接它們。請聯絡您的系統管理者來解決問題。";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "您沒有連接此伺服器的權限。";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "此伺服器不允許“訪客”連線。";
"EINFO_SAME_MACHINE_UNKNOWN" = "此檔案伺服器目前可以在您的電腦上使用。請取用本機上的卷宗和檔案。";
"EINFO_NO_SERVER_UNKNOWN" = "伺服器可能不存在或目前無法使用。請檢查伺服器名稱或 IP 位址和您的網路連線，然後再試一次。";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "檔案伺服器不允許其他使用者登入。請稍後再嘗試連接。";
"EINFO_GENERAL_UNKNOWN" = "連接伺服器時發生錯誤。請檢查伺服器名稱或 IP 位址，然後再試一次。\n\n若您無法解決問題，請聯絡您的系統管理者。";
"EINFO_NO_SHARES_UNKNOWN" = "沒有共享的項目，或是您未被允許在伺服器上連接它們。請聯絡您的系統管理者來解決問題。";

"EINFO_UNKNOWN_MOUNT_FAILED" = "裝載卷宗時發生錯誤。";
"EINFO_ONE_MOUNT_FAILED" = "無法裝載卷宗“%@”。";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "無法裝載以下卷宗：";
